In [1]:
import pandas as pd
import numpy as np

In [2]:
veri={
    "Isim":["Ömer","Faruk","Doğan","Ayşe"],
    "Alanlar":["Bilgisayar","Yazılım","Elektronik","Yazılım"],
    "Maas":[1000,2000,3000,4000]
}

In [3]:
data=pd.DataFrame(veri)

In [6]:
data["Alanlar"].unique()

array(['Bilgisayar', 'Yazılım', 'Elektronik'], dtype=object)

In [7]:
data["Alanlar"].nunique() # unique olanların sayısını gösterir.

3

In [8]:
data["Alanlar"].value_counts()

Yazılım       2
Bilgisayar    1
Elektronik    1
Name: Alanlar, dtype: int64

In [9]:
def brutMaasNetCevir(deger):
    return deger*0.66

In [15]:
data["Maas"]=data["Maas"].apply(brutMaasNetCevir)

In [16]:
data

    Isim     Alanlar    Maas
0   Ömer  Bilgisayar   660.0
1  Faruk     Yazılım  1320.0
2  Doğan  Elektronik  1980.0
3   Ayşe     Yazılım  2640.0

In [17]:
data.isnull()

    Isim  Alanlar   Maas
0  False    False  False
1  False    False  False
2  False    False  False
3  False    False  False

In [23]:
yeni_veri={
    "Sehirler":["Adıyaman","Adıyaman","Malatya","Elazığ","Elazığ","Adıyaman"],
    "Isimler":["Ömer","Faruk","Doğan","Caner","Manas","Sayit"],
    "Yas":[18,19,20,21,22,23]
}

In [24]:
data1=pd.DataFrame(yeni_veri)

In [25]:
data1

   Sehirler Isimler  Yas
0  Adıyaman    Ömer   18
1  Adıyaman   Faruk   19
2   Malatya   Doğan   20
3    Elazığ   Caner   21
4    Elazığ   Manas   22
5  Adıyaman   Sayit   23

In [26]:
data1.pivot_table(values="Yas",index=["Sehirler","Isimler"])

                  Yas
Sehirler Isimler
Adıyaman Faruk     19
         Sayit     23
         Ömer      18
Elazığ   Caner     21
         Manas     22
Malatya  Doğan     20